Repository: sslavik/acdat
Catalog: TMXParser/en-es.tmx
Source language: en
Languages: es

source: If offset is positive then the start of removed portion is at that offset from the beginning of the input If offset is positive then the start of removed portion is at that offset from the beginning of the input array.
es: Si el desplazamiento es positivo, el comienzo de la parte suprimida sería en esa posición desde el comienzo de la matriz de entrada.

source: If offset is negative then it starts that far from the end of the input array.
es: Si el desplazamiento es negativo, se cuenta la posición desde el final de la matriz de entrada.

source: If length is omitted, removes everything from offset to the end of the array.
es: Si se omite tamano, se suprime todo desde el desplazamiento hasta el final de la matriz.

source: If length is specified and is positive, then that many elements will be removed.
es: Si se especifica el tamano y es positivo, se suprimirán tantos elementos como se especifica.

source: If length is specified and is negative then the end of the removed portion will be that many elements from the end of the array.
es: Si fuera negativo, el final de la porción eliminada estará a tantos elementos del final de la matriz.

source: Tip: to remove everything from offset to the end of the array when replacement is also specified, use count( $input) for length.
es: Truco: para eliminar todo desde el desplazamiento hasta el final de la matriz cuando también se especifica sustitucion, utilice count( $entrada) como tamano.

source: If replacement array is specified, then the removed elements are replaced with elements from this array.
es: Si se especifia la matriz de sustitucion, entonces los elementos suprimidos son reemplazados con los elementos de dicha matriz.

source: If offset and length are such that nothing is removed, then the elements from the replacement array are inserted in the place specified by the offset.
es: Si los valores de desplazamiento y tamano son tales que nada es borrado, los elementos de la matriz sustitucion se insertarán en la posición indicada por el desplazamiento.

source: Tip: if the replacement is just one element it is not necessary to put array() around it, unless the element is an array itself.
es: Truco: si sólo se va a sustituir algo por un elemento nada más, no hace falta poner array() alrededor del mismo, salvo que dicho elemento sea una matriz en sí mismo.

source: The following equivalences hold:
es: Las siguientes funciones son equivalentes:

source: array_push ($input, $x, $y) array_splice ($input, count ($input), 0, array ($x, $y)) array_pop ($input) array_splice ($input, -1) array_shift ($input) array_splice ($input, 0, 1) array_unshift ($input, $x, $y) array_splice ($input, 0, 0, array ($x, $y)) $input[$x] = $y array_splice ($input, $x, 1, $y)
es: array_push( $entrada, $x, $y) array_splice($entrada, count($entrada), 0, array($x, $y)) array_pop($entrada) array_splice($entrada, -1) array_shift($entrada) array_splice($entrada, 0, 1) array_unshift($entrada, $x, $y) array_splice($entrada, 0, 0, array($x, $y)) $a[$x] = $y array_splice($entrada, $x, 1, $y)

source: Returns the array consisting of removed elements.
es: Devuelve una matriz que tiene los elementos eliminados

source: Example 1. array_splice() examples
es: Ejemplos de array_splice()

source: $input = array ("red", "green", "blue", "yellow"); array_splice ($input, 2); / / $input is now array ("red", "green") $input = array ("red", "green", "blue", "yellow"); array_splice ($input, 1, -1); / / $input is now array ("red", "yellow") $input = array ("red", "green", "blue", "yellow"); array_splice ($input, 1, count($input), "orange"); / / $input is now array ("red", "orange") $input = array ("red", "green", "blue", "yellow"); array_splice ($input, -1, 1, array("black", "maroon")); / / $input is now array ("red", "green", / / "blue", "black", "maroon")
es: Vea también: array_slice().

source: See also array_slice().
es: Esta función fue añadida en el PHP 4.0.

source: Example 1. array_sum() examples
es: Ejemplo 1. array_sum() examples

source: Example 1. array_unique() example
es: Ejemplo 1. array_unique() example

source: Example 2. array_unique() and types
es: Ejemplo 2. array_unique() and types

source: array_unshift() prepends passed elements to the front of the array.
es: array_unshift() añade los elementos que se le pasan al principio de la matriz.

source: Example 1. array_unshift() example
es: Ejemplo de array_unshift()

source: $queue = array ("orange", "banana"); array_unshift ($queue, "apple", "raspberry");
es: $cola = array( "p1", "p3"); array_unshift($cola, "p4", "p5", "p6");

source: This would result in $queue having the following elements:
es: Vea también: array_shift(), array_push(), y array_pop().

source: Array ([0] = apple [1] = raspberry [2] = orange [3] = banana)
es: Nota:

source: See also array_shift(), array_push(), and array_pop().
es: Esta función fue añadida en el PHP 4.0.

source: $array = array ("size "= "XL", "color" = "gold"); print_r(array_values ($array));
es: array_values() devuelve todos los valores de la matriz entrada.

source: This will output:
es: Ejemplo 1.

source: Implementation of array_values() for PHP 3 users
es: Nota:

source: See also array_keys().
es: Esta función fue añadida en el PHP 4.0.

source: Applies the user-defined function function to each element of the array array.
es: Aplica la función llamada func a cada elemento de la matriz.

source: The array parameter 's value being the first, and the key / index second.
es: La función func recibirá el valor de la matriz como primer parámetro y la clave como segundo.

source: If the optional userdata parameter is supplied, it will be passed as the third parameter to the callback function.
es: Si se proporciona el parámetro datosvarios será pasado como tercer parámetro a la función de usuario.

source: If function function requires more parameters than given to it, an error of level E_WARNING will be generated each time array_walk() calls function.
es: Si func necesita más de dos o 3 argumentos, dependiendo de datosvarios, se generará un aviso cada vez que array_walk() llama a func.

source: These warnings may be suppressed by prepending the PHP error operator @ to the array_walk() call, or by using error_reporting().
es: Estos avisos pueden suprimirse si se pone '@' antes de la llamada a array_walk(), o usando la función error_reporting().

source: Then, any changes made to those elements will be made in the original array itself.
es: Si func precisa trabajar con los valores reales de la matriz, especifique que el valor del primer parámetro de func debe pasarse por referencia.

source: array_walk() is not affected by the internal array pointer of array. array_walk() will walk through the entire array regardless of pointer position.
es: Desde ese instante, los cambios realizados sobre dichos elementos también serán realizados en la propia matriz.

source: To reset the pointer, use reset().
es: Nota:

source: Users may not change the array itself from the callback function. e.g.
es: El pasar la clave y los datos de usuario a func fue una característica añadida en PHP 4.0.

source: If the array that array_walk() is applied to is changed, the behavior of this function is undefined, and unpredictable.
es: Ejemplo 1.

source: Example 1. array_walk() example
es: Ejemplo de array_walk()

source: See also list(), foreach, each(), and call_user_func_array().
es: Vea también: each() y list().

source: This is used mainly when sorting associative arrays where the actual element order is significant.
es: Esta función ordena una matriz de modo que los índices mantengan su correlación con los elementos de la misma a los que están asociados.

source: $fruits = array ("d"= "lemon", "a"= "orange", "b"= "banana", "c"= "apple"); arsort ($fruits); reset ($fruits); while (list ($key, $val) = each ($fruits)) {echo "$key = $val\n";}
es: Esto se utiliza principalmente para ordenar matrices asociativas en las que el orden de los elementos es importante.

source: a = orange d = lemon b = banana c = apple
es: Ejemplo de arsort()

source: You may modify the behavior of the sort using the optional parameter sort_flags, for details see sort().
es: $frutas = array ("d"= "limón", "a"= "naranja", "b"= "plátano", "c"= "manzana"); arsort ($frutas); for (reset ($frutas); $clave = key ($frutas); next ($frutas)) {echo "frutas[$clave] = ".$frutas[$clave] ."\n";}

source: See also asort(), rsort(), ksort(), and sort().
es: Vea también: asort(), rsort(), ksort(), y sort().

source: Returns the arc sine of arg in radians. asin() is the complementary function of sin(), which means that a==sin(asin(a)) for every value of a that is within asin() 's range.
es: Devuelve el arco seno de arg en radianes.

source: See also asinh(), acos() and atan().
es: Vea también acos() y atan().

source: $fruits = array ("d"= "lemon", "a"= "orange", "b"= "banana", "c"= "apple"); asort ($fruits); reset ($fruits); while (list ($key, $val) = each ($fruits)) {echo "$key = $val\n";}
es: Esto se utiliza principalmente para ordenar matrices asociativas en las que el orden de los elementos es importante.

source: c = apple b = banana d = lemon a = orange
es: Ejemplo de asort()

source: See also arsort(), rsort(), ksort(), and sort().
es: Vea también: arsort(), rsort(), ksort(), y sort().

source: aspell_check() checks the spelling of a word and returns TRUE if the spelling is correct, FALSE if not.
es: aspell_check() comprueba la ortografía de una palabra, y devuelve cierto (TRUE) si la ortografía es correcta ,falso (FALSE) si no lo es.

source: Example 1. aspell_check()
es: Ejemplo 1. aspell_check

source: aspell_check_raw() checks the spelling of a word, without changing its case or trying to trim it in any way and returns TRUE if the spelling is correct, FALSE if not.
es: Si está bien, devuelve cierto (TRUE), si no lo está, devuelve falso (FALSE).

source: Example 1. aspell_check_raw()
es: Ejemplo 1. aspell_check_raw

source: Aspell functions [deprecated]
es: Funciones Aspell [deprecated]

source: Returns FALSE on error.
es: aspell_new() Abre un nuevo diccionario devolviendo el identificador de este para ser utilizado en otras funciones ortográficas.

source: Example 1. aspell_new()
es: Nuevo_diccionario

source: aspell_suggest() returns an array of possible spellings for the given word.
es: aspell_suggest() devuelve una matriz con posibles correciones ortográficas para la palabra dada.

source: Example 1. aspell_suggest()
es: Ejemplo 1. aspell_suggest

source: BCMath Arbitrary Precision Mathematics Functions
es: Funciones matemáticas de precisión arbitraria BCMath

source: PHP Options Information
es: opciones e información de PHP

source: This function calculates the arc tangent of the two variables x and y.
es: Esta función calcula la arco tangente de las dos variables x e y.

source: It is similar to calculating the arc tangent of y / x, except that the signs of both arguments are used to determine the quadrant of the result.
es: Es similar a el cálculo de la arco tangente de y / x, excepto que los signos de ambos argumentos son usados para determinar el cuadrante del resultado

source: The function returns the result in radians, which is between -PI and PI (inclusive).
es: La función devuelve el resultado en radianes, el cual está entre -PI y PI (inclusive).

source: See also acos() and atan().
es: Vea también acos() y atan().

source: Returns the arc tangent of arg in radians. atan() is the complementary function of tan(), which means that a==tan(atan(a)) for every value of a that is within atan() 's range.
es: Devuelve la arco tangente de arg en radianes.

source: See also atanh(), asin() and acos().
es: Vea también acos() y atan().

source: base64_decode() decodes encoded_data and returns the original data.
es: base64_decode() decodifica datos_cifrados y devuelve los datos originales.

source: The returned data may be binary.
es: Los datos devueltos pueden ser binarios.

source: See also: base64_encode(), RFC 2045 section 6.8.
es: Vea también: base64_encode(), RFC-2045 sección 6.8.

source: URL Functions
es: Funciones URL

source: base64_encode() returns data encoded with base64.
es: base64_encode() devuelve datos cifrados en base64.

source: This encoding is designed to make binary data survive transport through transport layers that are not 8-bit clean, such as mail bodies.
es: Esta codificación está pensada para que los datos binarios sobrevivan al transporte a través de capas que no son de 8 bits, como por ejemplo los cuerpos de los mensajes de correo.

source: Base64-encoded data takes about 33% more space than the original data.
es: Los datos codificados con Base64 ocupan aproximadamente un 33% más de espacio que los datos originales.

source: See also: base64_decode(), chunk_split(), RFC 2045 section 6.8.
es: Vea también: base64_decode(), chunk_split(), RFC-2045 sección 6.8.

source: Returns a string containing number represented in base tobase.
es: Devuelve una cadena conteniendo el number representado en base tobase.

source: The base in which number is given is specified in frombase.
es: La base en la cual number es dado viene especificada en frombase.

source: Both frombase and tobase have to be between 2 and 36, inclusive.
es: Tanto frombase y tobase tienen que estar entre 2 y 36, inclusive.

source: Digits in numbers with a base higher than 10 will be represented with the letters a-z, with a meaning 10, b meaning 11 and z meaning 35.
es: Los dígitos en números con una base mayor que 10 serán representados con las letras a-z, a vale 10, b vale 11 y z vale 36.

source: Example 1. base_convert()
es: Ejemplo 1. base_convert()

source: Given a string containing a path to a file, this function will return the base name of the file.
es: Dada una cadena (string) que contiene el path de un fichero, esta función devuelve el nombre base del fichero.

source: On Windows, both slash (/) and backslash (\) are used as path separator character.
es: En Windows, tanto la barra (/) como la barra inversa (\) pueden usarse como caracter separador en el path.

source: In other environments, it is the forward slash (/).
es: En otros entornos, se usa la barra directa (/).

source: Example 1. basename() example
es: Ejemplo 1.

source: See also: dirname()
es: Ver también: dirname()

source: Filesystem functions
es: Funciones del sistema de ficheros

source: Adds the left_operand to the right_operand and returns the sum in a string.
es: Suma el operando izq con el operando der y devuelve la suma en una cadena de texto.

source: The optional scale parameter is used to set the number of digits after the decimal place in the result.
es: El parámetro opcional escala se usa para fijar el número de dígitos tras el punto decimal que aparecerán en el resultado.

source: See also bcsub().
es: Vea también bcsub().

source: Compares the left_operand to the right_operand and returns the result as an integer.
es: Compara el operando izq con el operando der y devuelve el resultado como un entero.

source: The optional scale The optional scale parameter is used to set the number of digits after the decimal place which will be used in the comparison.
es: El parámetro opcional escala El parámetro opcional escala se usa para fijar el número de dígitos tras el punto decimal que se utilizarán en la comparación.

source: The return value is 0 if the two operands are equal.
es: El valor devuelto es 0 si los dos operandos son iguales.

source: If the left_operand is larger than the right_operand the return value is +1 and if the left_operand is less than the right_operand the return value is -1.
es: Si el operando izq es mayor que el operando der el valor devuelto es +1 y si el operando izq es menor que el operando der el valor devuelto es -1.

source: Divides the left_operand by the right_operand and returns the result.
es: Divide el operando izq por el operando der y devuelve el resultado.

source: The optional scale sets the number of digits after the decimal place in the result.
es: El parámetro opcional escala fija el número de dígitos tras el punto decimal a usar en el resultado.

source: See also bcmul().
es: Ver también bcmul().

source: Get the modulus of the left_operand using modulus.
es: Obtiene el módulo del operando izq usando modulo.

source: See also bcdiv().
es: Ver también bcdiv().

source: Multiply the left_operand by the right_operand and returns the result.
es: Multiplica el operando izq por el operando der y devuelve el resultado.

source: Raise x to the power y.
es: Eleva x a la potencia de y.

source: The optional scale can be used to set the number of digits after the decimal place in the result.
es: El parámetro opcional escala se puede usar para fijar el número de dígitos tras el punto decimal del resultado.

source: See also bcpowmod(), and bcsqrt().
es: Ver también bcsqrt().

source: This function sets the default scale parameter for all subsequent bc math functions that do not explicitly specify a scale parameter.
es: Esta función fija el parámetro de escala por defecto para las subsiguientes funciones matemáticas bc que no especifican dicho parámetro explícitamente.

source: Return the square root of the operand.
es: Devuelve la raíz cuadrada del operando.

source: The optional scale parameter sets the number of digits after the decimal place in the result.
es: El parámetro opcional escala fija el número de dígitos tras el punto decimal del resultado.

source: See also bcpow().
es: Ver también bcpow().

source: Subtracts the right_operand from the left_operand and returns the result in a string.
es: Resta el operando der del operando izq y devuelve el resultado en una cadena.

source: See also bcadd().
es: Ver también bcadd().

source: Bzip2 Compression Functions
es: Funciones de compresión Bzip2

source: Returns an ASCII string containing the hexadecimal representation of str.
es: Devuelve una cadena ASCII que contiene la representación hexadecimal de cad.

source: See also pack() and unpack().
es: La conversión se realiza byte a byte, con los 4 bits superiores primero.

source: Returns the decimal equivalent of the binary number represented by the binary_string argument.
es: Devuelve el equivalente decimal del número binario representado por el argumento binary_string.

source: bindec() converts a binary number to an integer.
es: BinDec convierte un número binario en un número decimal.

source: The largest number that can be converted is 31 bits of 1 's or 2147483647 in decimal.
es: El mayor número que puede ser convertido son 31 bits de unos o 2147483647 en decimal.

source: See also: decbin().
es: Vea también la función decbin().

source: Gettext
es: GNU Gettext

source: The bindtextdomain() function sets the path for a domain.
es: La función bindtextdomain() establece la ruta para el dominio.

source: Example 1. bzcompress() Example
es: Ejemplo 1. bzcompress() Example

source: Example 1. bzdecompress()
es: Ejemplo 1. bzdecompress()

source: Example 1. bzerror() Example
es: Ejemplo 1. bzerror() Example

source: Example 1. bzopen() Example
es: Ejemplo 1. bzopen() Example

source: Example 1. bzread() Example
es: Ejemplo 1. bzread() Example

source: Example 1. bzwrite() Example
es: Ejemplo 1. bzwrite() Example

source: Calendar functions
es: Funciones de calendario

source: This function will return the number of days in the month of year for the specified calendar.
es: Esta función devuelve el numero de dias en el mes del año para el calendario especificado calendario.

source: See also jdtounix().
es: Ver también jdtounix().

source: Call a user defined function given by the function parameter.
es: Call a user defined function given by the function_name parameter.

source: Class / Object Functions
es: Funciones de Clases / Objectos

source: CCVS API Functions
es: Funciones del API de CCVS

source: Returns the next highest integer value by rounding up value if necessary.
es: Devuelve el valor entero superior más cercano a number.

source: The return value of ceil() is still of type float as the value range of float is usually bigger than that of integer.
es: El uso de ceil() con enteros es una perdida de tiempo absoluta.

source: Example 1. ceil() example
es: Use: $new = (double)ceil($number); para tener el comportamiento antiguo.

source: See also floor() and round().
es: Vea también floor() y round().

source: Changes PHP 's current directory to directory.
es: Cambia el directorio PHP actual a directory.

source: See also getcwd().
es: Devuelve FALSE si no puede cambiar al directorio, TRUE si todo va bien.

source: Directory functions
es: Funciones con directorios

source: Returns TRUE if the date given is valid; otherwise returns FALSE.
es: Devuelve un valor verdadero si la fecha dada es válida; en caso contrario, devuelve un valor falso.

source: Checks the validity of the date formed by the arguments.
es: Comprueba la validez de la fecha formada por los argumentos.

source: A date is considered valid if:
es: Se considera válida una fecha si:

source: year is between 1 and 32767 inclusive
es: el año está entre 0 y 32767, ambos incluidos

source: month is between 1 and 12 inclusive
es: el mes está entre 1 y 12, ambos incluidos

source: Day is within the allowed number of days for the given month.
es: el día está en el rango permitido para el mes dado.

source: See also mktime() and strtotime().
es: Se tienen en consideración los años bisiestos.

source: Date and Time functions
es: Funciones de fecha y hora

source: Searches DNS for records of type type corresponding to host.
es: Busca en DNS entradas del tipo type correspondientes a host.

source: type may be any one of:
es: Devuelve verdadero si encuentra algún registro; devuelve falso si no encuentra ninguno o sucedió algún error.

source: A, MX, NS, SOA, PTR, CNAME, AAAA, or ANY.
es: type puede ser:

source: Host may either be the IP address in dotted-quad notation or the host name.
es: A, MX, NS, SOA, PTR, CNAME, o ANY.

source: AAAA type added with PHP 4.3.0
es: Por defecto es MX.

source: See also getmxrr(), gethostbyaddr(), gethostbyname(), gethostbynamel(), and the named(8) manual page.
es: Ver también getmxrr(), gethostbyaddr(), gethostbyname(), gethostbynamel(), y named(8) en las páginas del manual.

source: Attempts to change the group of the file filename to group (specified by name or number).
es: Trata de cambiar el grupo al que pertenece el fichero filename al grupo group.

source: Only the superuser may change the group of a file arbitrarily; other users may change the group of a file to any group of which that user is a member.
es: Devuelve TRUE en caso de éxito; en otro caso devuelve FALSE.

source: Returns TRUE on success or FALSE on failure.
es: En Windows, no hace nada y devuelve TRUE.

source: See also chown() and chmod().
es: Ver también chown() y chmod().

source: To ensure the expected operation, you need to prefix mode with a zero (0):
es: Trata de cambiar los permisos del fichero especificado por filename a los permisos dados por mode.

source: The mode parameter consists of three octal number components specifying access restrictions for the owner, the user group in which the owner is in, and to everybody else in this order.
es: Cuidado que mode no es asumido de forma automática como un valor octal.

source: Number 1 means that you grant execute rights, number 2 means that you make the file writeable, number 4 means that you make the file readable.
es: Para asegurar que se hace la operación esperada necesitas anteponer un cero (0) como prefijo del parámetro mode:

source: You can also read more about modes on UNIX systems with 'man 1 chmod' and'man 2 chmod '.
es: chmod( "/ somedir / somefile", 755); / / decimal; probablemente incorrecto chmod (" / somedir / somefile", 0755); / / octal; valor correcto de mode
